Revit 2027 API
PDFExportOptions.GetExportInBackground Method
 Execute PDF export as a background process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetExportInBackground()
Public Function GetExportInBackground As Boolean
public:
bool GetExportInBackground()
member GetExportInBackground : unit -> bool
Return Value
Boolean
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace